## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=85012560228445960]
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
data.aws_iam_role.task_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Reading...
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_domain.aws_cloudfront_origin_access_control.s3_origin_access_control: Refreshing state... [id=E3TIS3ZVRN4PC6]
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_security_group.fargate_sg: Reading...
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
data.aws_sns_topic.my_sns: Reading...
data.aws_vpc.myvpc: Reading...
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
module.custom_nlb.module.nlb.data.aws_partition.current: Reading...
module.custom_nlb.module.nlb.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_kms_key.my_kms: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function-logs]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z006257634KDWA8TCRYLE]
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Read complete after 0s [id=minecraft-dynmaps]
module.custom_domain.aws_s3_bucket_public_access_block.dynmap_bucket: Refreshing state... [id=minecraft-dynmaps]
module.custom_domain.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3MIVUMTQXC1CM]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
data.aws_security_group.fargate_sg: Read complete after 0s [id=sg-07934f64784cd1b97]
data.aws_kms_key.my_kms: Read complete after 0s [id=fbe3a2e1-dee7-431a-8206-9cd2092c08df]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=user-action-filter-function-20240625031941065000000004]
module.custom_domain.aws_route53_record.dynmap_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_dynmap.smat710.com_A]
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Reading...
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Read complete after 0s [id=1380009931]
module.custom_domain.aws_s3_bucket_policy.allow_access_from_cloudfront: Refreshing state... [id=minecraft-dynmaps]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20240625031941091500000005]
module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0]: Refreshing state... [id=user-action-filter-function]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_lambda_permission.log_permission: Refreshing state... [id=terraform-20240625031955188100000007]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_security_group.this[0]: Refreshing state... [id=sg-035af4b2a2bf35509]
module.custom_nlb.module.nlb.aws_lb_target_group.this["ex-target-one"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625031939359900000002/657370a96f4e5fe3]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0f8e1b5c574ab213c]
module.custom_nlb.module.nlb.aws_vpc_security_group_ingress_rule.this["all_tcp"]: Refreshing state... [id=sgr-01864eb972222db97]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/ce4eff76d607f517]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=2141358257438428086]
module.custom_nlb.module.nlb.aws_lb_listener.this["ex-one"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/ce4eff76d607f517/f7640629431ebf2a]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_minecraft.smat710.com_A]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.custom_ecs.aws_ecs_service.main has been deleted
  - resource "aws_ecs_service" "main" {
      - desired_count                      = 1 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service" -> null
      - name                               = "minecraft-test-service" -> null
        tags                               = {}
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/lambda/user-action-filter-function" -> null
        id                = "/aws/lambda/user-action-filter-function"
      - name              = "/aws/lambda/user-action-filter-function" -> null
        tags              = {}
        # (4 unchanged attributes hidden)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0] has been deleted
  - resource "aws_iam_policy" "additional_json" {
      - arn              = "arn:aws:iam::528163014577:policy/user-action-filter-function" -> null
        id               = "arn:aws:iam::528163014577:policy/user-action-filter-function"
        name             = "user-action-filter-function"
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0] has been deleted
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::528163014577:policy/user-action-filter-function-logs" -> null
        id               = "arn:aws:iam::528163014577:policy/user-action-filter-function-logs"
        name             = "user-action-filter-function-logs"
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::528163014577:role/user-action-filter-function" -> null
        id                    = "user-action-filter-function"
      - name                  = "user-action-filter-function" -> null
        tags                  = {}
      - unique_id             = "AROAXV6HYA6Y6QWCP4X5D" -> null
        # (7 unchanged attributes hidden)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function" -> null
      - function_name                  = "user-action-filter-function" -> null
        id                             = "user-action-filter-function"
      - invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function/invocations" -> null
      - last_modified                  = "2024-06-25T04:08:25.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:77" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:77/invocations" -> null
      - source_code_hash               = "yS4ypEuvLXFtDBEYXFyqKLxGae7SnT3RieLYTPAxkwQ=" -> null
      - source_code_size               = 1013 -> null
        tags                           = {}
      - version                        = "77" -> null
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-cpu_utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "memory_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-memory_utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "target_group_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_description                     = "This metric monitors ecs health status"
      + alarm_name                            = "minecraft-test-targetgroup_healthy"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "net/minecraft-test-nlb/ce4eff76d607f517"
          + "TargetGroup"  = "targetgroup/tf-20240625031939359900000002/657370a96f4e5fe3"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/NetworkELB"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count will be created
  + resource "aws_cloudwatch_metric_alarm" "task_running_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-task_running_count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RunningTaskCount"
      + namespace                             = "ECS/ContainerInsights"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.custom_domain.aws_route53_record.apps_dns will be created
  + resource "aws_route53_record" "apps_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "minecraft.smat710.com"
      + type            = "A"
      + zone_id         = "Z006257634KDWA8TCRYLE"

      + alias {
          + evaluate_target_health = true
          + name                   = (sensitive value)
          + zone_id                = (sensitive value)
        }
    }

  # module.custom_domain.aws_route53_record.dynmap_dns will be created
  + resource "aws_route53_record" "dynmap_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dynmap.smat710.com"
      + type            = "A"
      + zone_id         = "Z006257634KDWA8TCRYLE"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1st6ytcaf84op.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.custom_domain.aws_s3_bucket_policy.allow_access_from_cloudfront will be created
  + resource "aws_s3_bucket_policy" "allow_access_from_cloudfront" {
      + bucket = "minecraft-dynmaps"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceArn" = "arn:aws:cloudfront::528163014577:distribution/E3MIVUMTQXC1CM"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudfront.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::minecraft-dynmaps/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.custom_domain.aws_s3_bucket_public_access_block.dynmap_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "dynmap_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "minecraft-dynmaps"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.custom_ecs.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "minecraft-test-service"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "minecraft-test"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "minecraft"
          + container_port   = 25565
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625031939359900000002/657370a96f4e5fe3"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-07934f64784cd1b97",
            ]
          + subnets          = [
              + "subnet-038ab87acb09d9140",
              + "subnet-0b514cfc7d0eb8f87",
            ]
        }
    }

  # module.custom_ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test:184" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "minecraft-test" -> (known after apply)
      ~ revision                 = 184 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "data" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "log-volume" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "log-volume"
        }
    }

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{ ($.level = \"ERROR\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-0"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = (sensitive value)
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-1"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_lambda_permission.log_permission will be created
  + resource "aws_lambda_permission" "log_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "logs.ap-northeast-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/ecs/minecraft-firelens-logs:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/user-action-filter-function"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "user-action-filter-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "SNS:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/ecs/minecraft-firelens-logs:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-1:528163014577:key/fbe3a2e1-dee7-431a-8206-9cd2092c08df"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "user-action-filter-function-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "user-action-filter-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "user-action-filter-function"
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "user-action-filter-function"
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "My awsome lambda function"
      + filename                       = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.zip"
      + function_name                  = "user-action-filter-function"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 360
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALARM_SUBJECT" = "【UserEvent Notification】"
              + "SNS_TOPIC_ARN" = "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic"
              + "WEB_HOOK_URL"  = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = 512
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_listener.this["ex-one"] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/ce4eff76d607f517"
      + port              = 25565
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625031939359900000002/657370a96f4e5fe3"
          + type             = "forward"
        }
    }

  # module.custom_nlb.module.nlb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = "sg-035af4b2a2bf35509"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.custom_nlb.module.nlb.aws_vpc_security_group_ingress_rule.this["all_tcp"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "TCP traffic"
      + from_port              = 25565
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-035af4b2a2bf35509"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 25565
    }

Plan: 23 to add, 0 to change, 1 to destroy.

Warning: AWS resource not found during refresh

  with module.custom_nlb.module.nlb.aws_vpc_security_group_egress_rule.this["all"],
  on .terraform/modules/custom_nlb.nlb/main.tf line 641, in resource "aws_vpc_security_group_egress_rule" "this":
 641: resource "aws_vpc_security_group_egress_rule" "this" {

Automatically removing from Terraform State instead of returning the error,
which may trigger resource recreation. Original error: couldn't find resource

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>